{
  "abilityscores": [
    {
      "name": "Ability Scores",
      "sections": [
        {
          "name": "Calculating Ability Scores",
          "body": [
            {
              "name": "Rolling for stats",
              "book": "MOD",
              "body": "Dekatreis is a very high-powered world, where adventurers are expected to be stronger than usual. As such, when a player rolls for stats, they may roll 4d6, keeping only the highest 3 results. Additionally, they may reroll any dice that result in a 1 until the result of the dice being rerolled is at least 2. This is done six times and then distributed as the player wishes between their six ability scores: Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma.\n\nThis signifigantly bumps up the average ability scores of the players--so those used to running more low-powered games should be cautious at using this method."
            },
            {
              "name": "Point Buy",
              "book": "MOD",
              "body": "If a character chooses to use point buy for their ability scores, all their ability scores start at 7. From there, they have 36 points to use to increase these scores. Increasing ability scores costs 1 point initially and the cost increases as follows: Increasing an ability score past 13 costs 2 points, and increasing an ability score past 15 costs 3 points. A person cannot increase an ability score past 17 using this method, and the total cost of all a person's ability scores may not pass 36.\n\nFor example, if a character wished to have 16 Charisma, they would need to spend 13 points and would have 17 leftover to calculate the rest of their ability scores. As such, they could put another 13 points in raising their Dexterity to 16, and then put 8 points into Constitution to reach 14. Their last 2 points would be used to bring their Intelligence and Wisdom to 8 with 1 point each, and then their Strength would stay at 7.."
            },
            {
              "name": "Array",
              "book": "MOD",
              "body": "If you don't want to bother with adding up your scores, you could choose a pre-determined array of numbers to makeup your stats. These are equal to the sum of point buy's stats, but are spread out for simplicity. Your Dungeon Master may also provide his own array to use.\n\nBalanced: 16/14/14/10/10/8\nSpecialist: 17/17/8/8/7/7\nJack of All Trades: 13/13/13/13/13/13"
            }
          ]
        }
      ]
    }
  ]
}
