{
  "heroicinspiration": [
    {
      "name": "Heroic Inspiration",
      "sections": [
        {
          "name": "Basic Information",
          "body": [
            {
              "name": "Gaining Heroic Inspiration",
              "body": "Heroic Inspiration replaces Hero Points in the Pathfinder 2 system. Whereas Hero Points allow you to reroll a check or come back from death, Heroic Inspiration allows a player to more greatly modify the game through cunning usage of their Heroic Inspiration points. Heroic Inspiration points are given to the entire group at once when the game master has decided that the party has overcome a great obsticle, worked well together to overcome the odds, or otherwise proven themselves to be heroes in their own right. While each member gains a Heroic Inspiration Point, the players can each use their points individually or save them for later usage. The players can have a maximum of 3 Heroic Inspiration Points and no more."
            },
            {
              "name": "Using Heroic Inspiration",
              "body": "There are many ways for players to use Heroic Inspiration points. Below are listed a few examples, but the game master may add additional options, or a player may ask to ues their points for something that hasn't been specified but falls within the spirit of the Heroic Inspiration points. As always, the game master is always the decider on what the limit is, but below are a few examples.\n\n• Defy Death. You may spend one Heroic Inspiration point to automatically stabilize when you are at 0 hitpoints, or use it to stabilize another creature within 120 feet that is at 0 hitpoints. You or the creature you choose to stabilize also regains a number of hitpoints equal to your level.\n• Reroll. You may spend two Heroic Inspiration points to reroll a d20 that you have just rolled. You choose whether to keep the new roll or use the old roll.\n• Spell Surge. You may spend your Heroic Inspiration points on your turn to regain expended spell slots. The combined levels of spell slots you regain may not equal more than the number of Heroic Inspiration points you are spending. For example, with 3 Heroic Inspiration points you could recover a 2nd level and 1st level spell slot, or a 3rd level spell slot.\n• Quick Moving. You may spend your inspiration during any turn in combat in order to gain a second turn in combat yourself. You take this turn immediately after the current turn has ended.\n• True Strike. You may spend one Heroic Inspiration point whenever you roll damage for a weapon or spell to multiply the damage by two. This counts for all damage from abilities or features used with the weapon or spell, such as a critical strike."
            }
          ]
        }
      ]
    }
  ]
}
