{
  "akiira": [
    {
      "name": "Akiira",
      "sections": [
        {
          "name": "General Knowledge",
          "body": "In the direct beginnings of Dekatreis among the formations of the continents, Akiira was made atop of a huge reserve of natural magic in the world. Sensing it, Vondal formed the continent that would become Akiira, and Kavara populated the place with all sorts of experimental creatures. From the sun and moon elves, long extinct back on Toril, to the were-beasts and several species of draconics and monstrosities. Magic flowed easily from the Book of Creation, almost enticing its power to the land itself.\n\nDuring the rule of the Queen, Akiira was quickly overpopulated by the Sun and Moon Elves first and foremost, and people from other kingdoms migrated there using ships to explore the vast, magically-excited lands for themselves, in awe of how bright and colourful everything seemed. Every flower had life to it greater than anything seen on the other continents, and the people seemed more innately skilled at the arcane and psionic. It rose to become a grand centre of magical research during the Queen's reign, enticing them to forge a pact between Dekatreis and Sarille to share magical knowledge so that all may benefit. However, this same pact seemed to become their downfall, as upon accusation that Sarille's prince was hiding an artefact from the other two nations, chaos broke loose.\n\nThe War of the Five Elves showed the raw force of the Akiiran people, easily taking down Sarille's armies of dark elves with Dekatreis moving in on the other side. The victories for Akiira, however, fell short once the the Apple of Discord was used to corrupt and ravage the minds of the people, enticing them to slay the Sun and Moon elves to absolutely devastate their war efforts. In the end, it was complete genocide of the two races, and by the time the war had come to a close, Akiira had been cursed by its own magic.\n\nNo one seemed safe in the lands. Magical beasts couldn't think straight, attacking any life that moved. Increased potency of magical chaos in the land allowed such beasts to be granted immense magical abilities to carry out their attacks, and spells could hardly be considered stable either. The Akiiran cities were brought to ruins in little more than a few years, and inhabitance would reduce to only the insane monsters, and the fearless adventurers seeking riches in the destroyed remnants of Akiira."
        },
        {
          "name": "Anarchy of Akiira",
          "body": "With the genocide of the Sun and Moon Elves, Akiira was left without proper rulers, and it seemed impossible for the Queen to reign in control with the mess that the Apple of Discord had caused. Instead of putting in new rulers to a devastated land, she opened up the region for all kingdoms to use as they wished, declaring no one ruler may claim ownership of land on the territory. It would be open for research, exploration, and adventure, but it wouldn't be inhibited by politics.\n\nEven though there is no sole ruler in Akiira, somewhat of a large city formed over hundreds of years as adventurers passed through. The name of the city became New Sylvis, in recognition of the old Akiiran capital that had long ago fallen to chaos. The city is split into four separate areas, and frequently tensions run high against the researchers, the adventurers, and the travelling merchants as chaos threatens to seep past anti-magical fields placed around the city and ruin the inhabitants like it did so many others."
        }
      ]
    }
  ]
}
