{
  "akiira": [
    {
      "name": "Akiira",
      "sections": [
        {
          "name": "General Knowledge",
          "body": "In the direct beginnings of Dekatreis among the formations of the continents, Akiira was made atop of a huge reserve of natural magic in the world. Sensing it, Vondal formed the continent that would become Akiira, and Kavara populated the place with all sorts of experimental creatures. From the sun and moon elves, long extinct back on Toril, to the were-beasts and several species of draconics and monstrosities. Magic flowed easily from the Book of Creation, almost enticing its power to the land itself.\n\nLand itself among Akiira was populated by the elves first and foremost, and other races migrated there using ships to explore the vast, magically-excited lands for themselves, in awe of how bright and colourful everything seemed. Every flower had life to it greater than anything seen on the other continents, and the people seemed more innatedly skilled at the arcane and psionic. It rose to become a grand centre of magical research during the Queen's reign, enticing them to forge a pact between Dekatreis and Sarille to share magical knowledge so that all may benefit. However, this same pact seemed to become their downfall, as upon accusation that Sarille's prince was hiding an artefact from the other two nations, chaos broke loose.\n\nThe War of the Five Elves showed the raw force of the Akiiran people, easily taking down Sarille's armies of dark elves with Dekatreis moving in on the other side. The victories for Akiira, however, fell short once the prince used the Apple of Discord to corrupt and ravage the minds of the people of Akiira, enticing them to slay the Sun and Moon elves to absolutely devastate their war efforts. In the end, it was complete genocide of the two races, and by the time the war had come to a close, Akiira had been cursed by its own magic.\n\nNo one seemed safe in the lands. Magical beasts couldn't think straight, rather attacking any life that moved. Increased potency of magical chaos in the land allowed such beasts to be granted immense magical abilities to carry out their attacks, and spells could hardly be considered stable either. The Akiiran cities were brought to ruins in little more than a few years, and inhabitance would reduce to only the insane monsters, and the fearless adventurers seeking riches in the destroyed remnants of Akiira."
        },
        {
          "name": "Anarchy of Akiira",
          "body": ""
        }
      ]
    }
  ]
}
