{
  "azorianempire": [
    {
      "name": "Azorian Empire",
      "sections": [
        {
          "name": "General Knowledge",
          "body": "The beginnings of the Azorian Empire began as Azor: A combined empire of North Azor, emcompassing the icelands of the north, and South Azor, encompassing the equally as frigid desert to the south. In charge were two of the Queen's sons, Rose and Thorn Azorblood. The beginning years were grand; the resources of North Azor and the closeness to Sarille allowed a quick-paced embrace of technology. A strong relationship rose and allowed them to be second-best in development until the War of the Five Elves, where fear of getting dragged into the war forced the twins to temporarily suspend ties with Sarille.\n\nFrom there, tensions began to grind between Rose and Thorn over how to settle unrest in South Azor. The immediate suggestion was to have one move to rule over the sister continent, yet with the distance and Sarrile's war constricting their supplies necessary for development, neither wished to be the one to take up the risk. This eventually lead to a duel between the two, ending in the accidental death of Thorn at the hands of his sister.\n\nAs word of her brother's murder spread and more calls of South Azor to be fixed, Rose eventually stepped down and put her daughter, Rosalia II, in charge. Rosalia was assassinated during a violent protest that attacked the tower, and the throne went to her next daughter, Rosalia III, right as the War of the Five Elves ceased.\n\nThe third Princess to rule over the kingdom of Azor, with no other options to settle her kingdom, put her foot down and began to make sweeping changes in every civillian's life. From the farthest east to the farthest west, she declared that with Sarille's new government registration technology, she would have every single citizen forcefully registered and kept track of. Security cameras, high-tech doors, and guard constructs were imported in mass now that ties with Sarille could be mended, and total rulership with an iron fist was the absolute for Azor."
        },
        {
          "name": "Rosalia Azorblood IV",
          "body": "At the age of 435 after ruling for centuries, Rosalia III passed away, and her eldest daughter, Rosalia Azorbook IV, took the throne. Being taught by her mother in dominance and rulership, she kept the strong relationship with Sarille but wavered when it came to controlling her people. In many areas she lightened restrictions, such as requiring facial recognition, until an uprising in South Azor during the year 906 QY called her attention. She received word that her brother, Pavlos Azorblood, had claimed himself as Prince of the newfound kingdom of Azoranthium and separated all ties to Azor. To rebuke this, she acted fast and declared war: The Azorian Empire against the rebel nation of Azoranthium. The name change would be temporary, until they could reunify the lands.\n\nHowever, as she re-implimented facial recognition and harsher security to track down those would seek to terrorize and speak out against her, she easily saw she couldn't win the war. Azoranthium, without her knowledge, had began to create mass fleets of warships that were superior to the ships that she could produce, and Sarille refused to step into another war as Thallan Presthana had promised to not get into another conflict in the years before. Thus, she was alone at a stalemate, knowing she couldn't properly attack but her defenses were bolstered due to the trade partnership with Sarille.\n\nWithin the same year the war started, the Queen called Rosalia and Pavlos to her court and settled the matter after hearing both sides. Knowing there would truly be nothing agreeable between all parties, she simply did what was best for both lands and announced that Pavlos could maintain his position of Prince of Azoranthium, officially allowing the first new kingdom to the world. She warned that the war would not be re-started without consequences, and left the two siblings to their rulerships on opposite sites of the world.\n\nSince then, Rosalia has held an intense hatred of her brother and Azoranthium, seeing their progress and relations with Dekatreis as well as Totara as the biggest mistake in her rulership, constantly a reminder that she couldn't hold up to her mother."
        },
        {
          "name": "The Grand Arena",
          "body": "While many demigod artefacts have been hidden away, the one that maintains prevalence in daily society is the Book of Creation. Rosalia Azorblood III, during her long rule, had tracked down the infamous book that had the ability to create a living creature with a soul of any type. She could create life from nothing. However, knowing its abuse would cause mass hysteria, she instead began to host a bi-yearly game: The Grand Arena.\n\nEvery two years, the Princess of Azor would ask for people all across the world to register to fight in the arena. Hundreds of thousands would apply, but only the most skilled and luckiest thousand would be accepted to participate in a grand-scale multi-attributed tournament to prove their worth against all the other competitors. Whether in teams or going in solo, the potential prize was worth the risk of death, which was assured should one lose enough times.\n\nThe prize itself: One use of the Book of Creation, the ability to create any creature that they wished, with almost no limits. The limits, however, were not from the book but from Princess Rosalia herself, to ensure that no one destroyed the world. Besides that, throughout the years, she watched many adventurers battle each other, spill blood and gore, only to reach the end and ask for a variety of things. A re-creation of their loved ones who passed away, a Kathari to keep as a slave, a Mindflayer to study and test on, and even a young Shadow Dragon that would come to be known as an infamous adventurer's steed.\n\nWhen Rosalia III passed on, Rosalia IV picked up the mantle and continued the games, changing almost none of the rules when she saw how much entertainment it brought to the people of her land. It was the one thing that kept turmoil from boiling over into rebellion in the northern continent, and so she did her best never to tread the line when it came to the greatest, bloodiest sporting event of Dekatreis: The Grand Arena."
        }
      ]
    }
  ]
}
