{
  "creatorsprologue": [
    {
      "name": "Creator's Prologue",
      "sections": [
        {
          "name": "Welcome to Dekatreis",
          "body": "Dekatreis is the number \"thirteen\" in Greek. It's also the name of a techno-fantasy world that I've spent well over a decade creating and revising, and over the past 4 years I've converted parts of it into a D&D setting that I base all my campaigns in."
        },
        {
          "name": "A Story Never Finished",
          "body": "Dekatreis has been my high fantasy world concept since I was 10 years old. I first envisioned it when I thought of a world combined under one ruler, who wished for nothing but the chaos between competing rulers to stop, to be the presence that would settle disputes once they got out of hand. Someone that would be there for the people. That's where The Queen came in.\n\nHowever, the first major overhaul to the Dekatreis lore--and what turned it into its own separate world--happened in 2011 when I began to put together a story. Why did this world have a singular ruler? One wouldn't go to war and succeed if they wanted to take over the entire *world*. There'd be plenty of resistance. And besides, what would happen when that queen died? The chaos would fall right back into place.\n\nSo I started writing a book. I named the queen \"Viessa,\" and she was set to be the main character of this novel series of mine. She'd been raised by a powerful wizard who, upon her 21st birthday, granted her his most powerful possession: A staff that could control people. This solved the problem of who would listen to her rule, but there was something missing. The rest of the world.\n\nSo I expanded. I created a map of the world, divided it up into separate empires (There were 13 at one point, but that has since been reduced down to 6), and made princes and princesses for each empire to rule over them. The princes and princesses would act as vassals to the Queen, those that would rule below her, but ultimately she would step in if any of her princes or princesses would step out of line or cause too much chaos.\n\nThen I started to think, the Queen wasn't exactly fitting for a main character. She held too much power and I would eventually write myself into a corner. Sure, if I was a good writer, I could surpass this. Instead, I found it easier to write about some of these princes or princesses. That's how Rasha and Zella, of the Kingdom of Dekatreis, became the next 'main characters' of my book series.\n\nI wrote a decent amount, and I adored the character arcs I had planned for them, but school and other life issues tore my attention away until I just stopped. Rasha and Zella's adventures were on pause, and so was the entirety of Dekatreis."
        },
        {
          "name": "Dungeons & Dragons and Dekatreis",
          "body": "In late 2015, I was greeted to D&D by a group of friends. The first campaign I was apart of wasn't too special looking back on it. An urban, low-magic campaign, I played a tiefling Warlock, and everything seemed pretty mundane compared to what I get up to these days; but it was magical to me. Several campaigns later being a player, I finally decided I'd like to try GMing a game, and I knew exactly how I would do it:\n\nI would go back to Dekatreis.\n\nI spent a lot of my time from then on making notes, planning out the rest of the kingdoms, making a backstory and timeline for the world. And then I began to theorize, how did this strange world come to be? It's not that easy to simply say \"the world came into beginning.\" Toril isn't that simple, and neither is Dark Sun's world, Athas. Then, I remembered one of my old, old notes recalled something about 13 demigods. Yes, not gods. Just demigods. Mortals that had the power of gods. From there, inspiration"
        },
        {
          "name": "Conception of the Demigods",
          "body": "I decided that these 13 demigods were who created Dekatreis. Originally from Toril or another world in the Dungeons and Dragons style, they would find each other, form a group and strong bond with each other, then set out to make their own world. Each would have a powerful item that granted them god-like powers, and each member of this party would be valuable and necessary to turn the world into what it would become in my head. The first demigod I expanded on was Alethra Stormchild, and he would be the father of the Queen. His powerful staff was no longer just a magic staff. It would be an artefact, a powerful, divine-embedded item that radiates the power of a god. It would be how the Queen made the world bow to her rulership.\n\nThen, I had to decide, how did these demigods obtain their artefacts? Well, all of them were different. Alethra had forged his with the essence of the god of order. Kaylessa had been granted her's from her devotion to the goddess of healing, who saw all the good Kaylessa could do. Aurae Torran had gained his after making a bet with a god, and winning despite the odds.\n\nHow did they reach the world in the first place? Why this one in particular? Well, two things. One, after all 13 of the adventurers-turned-demigods had their artefacts, they were very powerful, but they couldn't create a planet out of the fabric of reality. They did, however, have the means to find empty worlds that they could change to fit their needs. Then, Aurae Torran had a special artefact that allowed him to place a teleportation circle at will anywhere he wished, then cast *Teleport* on himself and his companions to go there. With that combination of skills, they were able to reach Dekatreis--a planet of mostly water, with a single island, which would go on to become \"Queen's Island.\""
        }
      ]
    }
  ]
}
