{
  "dekatreis": [
    {
      "name": "Dekatreis",
      "sections": [
        {
          "name": "General Knowledge",
          "body": "The kingdom of Dekatreis was meant to be the Queen's pride and glory, the centre of the world and the kingdom to represent unity, development, and freedom. As such, she gave it to the High Elves and Wood Elves to allow for hundreds of years of prosperity and eager development. Quickly building up a structure to their capital city and welcoming all kinds of races, Dekatreis became a mixing pot for all kinds and enabled many developments that the Dark Elves of Sarille neglected or the Sun and Moon Elves of Akiira rejected. After the War of the Five Elves, however, Dekatreis was then given to one of the Queen's sons who grew particularly ambitious with wanting to help his people in the aftermath of the war. After saving the life of a legendary griffon, his bloodline was blessed with its magic and the griffon became the national symbol of the kingdom, as well as changing the royal name to Griffonblood. His twin daughters, Rasha and Zella, were destined to rule the throne together and upon passing, they took on his ideals to help their people but went further than he ever did. Funding an adventurer's guild named the House of Tessera, they enabled all kinds of people to find work throughout their kingdom, even helping set up locations in the most remote towns so that all of Dekatreis could have the chance to go out and adventure for work rather than be tied to menial tasks that could be better suited to constructs."
        },
        {
          "name": "Rasha Griffonblood",
          "body": "Rasha is the more prominent of the two Griffonblood Twins. Even though they are together almost always, Rasha takes over a scene with her undeniable grace and authorative voice, not allowing reporters or anyone else to overwhelm her sister. Protective and direct, she assures that when the Princesses promise something will be done, it is given a steady timeline and that it's seen finished.\n\nOutside of helping found the House of Tessera, Rasha took it upon herself to also strategically set up trade routes with the Totara Kingdom as well as Azoranthium. Despite earning the ire of Sarille from doing so, the prosperity that came from the sea-specialized Azoranthium and the exports of necessary resources to Totara has enabled the kingdom of Dekatreis to earn a grand amount of wealth that sustains their free social programs such as healthcare and education."
        },
        {
          "name": "Zella Griffonblood",
          "body": "Though her voice is not heard as often, when she speaks her tone provokes silence over a large majority of her audience. A soothing song flows through each of her words accompanying her understanding and wide-encompassing attenuation to problems of her citizens.\n\nAt her own discretion, Zella has been the focus of making the Princess' faces known and assuring her populace that they are fitting and caring rulers. Most prominently, the once-restricted doors of the Griffonblood Tower have been opened for public entry for any to come and meet the Princesses and decry their issues. In addition to personal viewing, Zella goes out of her way to allow as many directly forms of transmission from her people to herself as possible so that even the far cities at the ocean's edge can speak to her."
        }
      ]
    }
  ]
}
