{
  "demigods": [
    {
      "name": "The Demigods",
      "sections": [
        {
          "name": "The Original 13",
          "body": "The thirteen Demigods were those that met each other on a grand adventure. Originally beginning with Alethra Stormchild, Aurae Torran, Kavara, Cecelia, and Tyrae Valsh, their ambitions grew as they tested fate more and more and gained more allies to stride towards their goal to be the creators of a new world. Over time, each of them gained an artefact that would become legendary to history, and each of the Demigods would be given enough worship to be granted divinity in one way or another."
        },
        {
          "name": "Alethra Stormchild",
          "body": "Race: Human\nClass: Cleric\nStatus: Ascended, God of Order\nDomains: Order\nAlignment: Neutral\n\nAlethra Stormchild was one of the original members of the adventuring party that sought to become demigods, along with Aurae, Kavara, Cecelia, and Tyrae. In their early beginnings, he quickly became the lead, driving force for them all as they explored and fought their way through countless adventures until the day that they were saving kingdoms and even the entirety of Faerun.\n\nAs the group grew more powerful, Alethra and Aurae had growing ambitions, discovering and wielding powerful magical items and becoming more and more intermingled in the chaotic wars of gods and devils. The group, itself, wanted nothing more than to protect their people and earn a greater than decent living, alongside each of their own personal goals. However, over the course of a few weeks, Alethra, along with Aurae, managed to sink in and coerce everyone else into the idea that they could take a god's power to create their own world, and start from scratch, separate from Toril.\n\nStories tell that Alethra obtained his artefact, the Staff of Pure Order, by challenging a lesser deity to a duel and ultimately claiming some of their divine essence in order to speak with and command mass amounts of mortals, though it was never recorded that he used his artefact while on Dekatreis.\n\nAs the last to leave Dekatreis, he spent a lot of time with the people and assisted greatly in flourishing their history books and overseeing disputes being resolved peacefully. However, before he left, he had one child through the Book of Creation, named Viessa Stormchild, known in modern times as \"The Queen.\" Viessa offered her father's words to the history books, saying that he believed that the world would fall to chaos without the Demigods, and he wished for her to be the one to keep stability for Dekatreis.\n\nWith this, and after he hid the Staff of Pure Order in a well-kept, secret spot, he ascended in the year 2567 DY to the plane of Arborea, becoming the God of Order."
        },
        {
          "name": "Aurae Torran",
          "body": "Race: Human\nClass: Sorcerer\nStatus: Ascended, God of Magical Teleportation\nDomains: Arcana, Travel\nAlignment: Chaotic Good\n\nThough heavily debated between the two who came up with the idea to create a new world from scratch, no one can deny that Aurae and Alethra worked well together in their ventures. Alethra was the push forward, Aurae had the inspiration to make things become reality. A skilled sorcerer that honed his raw magic in order to devastate battlefields and put his creativity to the world, he was praised by all those around him. He even takes credit in many history books for being their most reliable force against the evil of Toril.\n\nIt's said by Aurae himself that in order to gain his artefact, the Amulet of True Teleportation--the key to getting to Dekatreis in the first place--he made a bet with a deity and won. Whether there's truth or not, and who the deity might have been, wasn't directly recorded but many of the other demigods backed his story up, only stating that the details were best left on the outer planes.\n\nThough speculated, it's unsure if Aurae hid his artefact on Dekatreis or took it with him. Either way, in the year 1649 DY, Aurae left the world of Dekatreis to ascend to divinity. With the worship of the world and his mystical power, he became the God of Magical Teleportation."
        },
        {
          "name": "Bequirel",
          "body": "Race: Zeletos\nClass: Cleric\nStatus: Unknown\nDomains: Life, Death, Grave\nAlignment: Neutral\n\nA mysterious entity with unsure connections to the rest of the Demigods, Bequirel was known vaguely yet it has been told that he assisted the Demigods immensely in their travels. Alethra himself knew little of Bequirel's history but welcomed him to the group once the skeleton-like person took interest in their ventures to create a new world.\n\nBequirel, strangely enough, obtained his artefact through two separate divine bodies. One half was crafted from the essence of Kiaransalee, and the other was obtained from Myrkul. With the essences of both deities, he was able to craft a mask, aptly named the \"Mask of Life and Death\" that could instantly resurrect or kill any creature that the wearer wished. With an immense control over the souls, Bequirel gained many enemies, particularly in cults of Kiaransalee who gained quick following in Dekatreis. However, he was also almost universally worshiped by all other mortals of Dekatreis, believing that he was the one who overlooked their lives and could bless them with a good death. Despite minimal interactions with the mortals, Bequirel gained legendary status among the people, and a yearly festival was created in his name to celebrate life and death. This festival, named the \"Festival of Duality,\" focuses on throwing a celebration for those that have passed with various games and sports, as well as encouraging new life through high spirits and plentiful food.\n\nThe second to last to leave the world of Dekatreis during the Departure of the Demigods, Bequirel vanished without a word on the year 2222 DY. However, many people believe that he still lingers on the world, and few adventurers will mutter beliefs that if one is lucky, Bequirel will resurrect them if they fall during an adventure. Whether true or not, the belief has inspired many daredevil adventurers to throw away any fears and seek excitement in exploring the vast world of Dekatreis."
        },
        {
          "name": "Cecelia",
          "body": "Race: High Elf\nClass: Technomancer\nStatus: Ascended, Goddess of Technology\nDomains: Technology, City\nAlignment: Lawful Neutral\n\nKnown as the patron of technology for Dekatreis, Cecelia took joy in exploring all kinds of magic mixed with technology, from weapons to clothing and even power sources. Her experimentation and research combined with the vast amount of resources at the group's disposal allowed her to craft a grand achievement and truly poise her as the ultimate technomancer. Using a combination of her own skill and the divine power of the dwarven god Dugmaren Brightmantle after completing a quest for him to gain his respect, she crafted the Ring of the Technotheurge, an item that could create any piece of technology she wished so long as she knew how to create it and had the materials near her.\n\nUsing the Ring of the Technotheurge, she immensely sped up the rate that technology was generated and integrated within Dekatreis. Even before true cities were erected, a central network to connect the entire world was created through a series of techno-magical nodes and wires as well as basic computers. She especially made sure to write down and explain every single item she made, so that they could be replicated without her ring.\n\nRightfully, she hid away her ring in the year 2100 DY and departed for the plane of Mechanus, where she ascended to godhood as the Goddess of Technology, worshipped for her innovations and allowing Dekatreis to be immediately interconnected with the whole planet."
        },
        {
          "name": "Fyrra Kelrae",
          "body": "Race: Tiefling\nClass: Fighter\nStatus: Unknown\nDomains: Antimage\nAlignment: Neutral Evil\n\nPerhaps not the most well-liked, nor did she like the rest of the Demigods so well, yet she stayed with the group in spite of her burning hatred of magic and, over time, technology. Fyrra saw such blatant abuse of magic and technology to be a disservice to people, weakening them and taking them away from the true style of fighting with grace and force entwined in swordsmanship. Her most bold move, however, was seen as she convinced the group to stage an attack on Mystra herself. In a hard-fought battle to rip away part of Mystra's essence, the Demigods defeated Mystra yet did not kill the magic goddess. Simply, Fyrra drowned her rapier in the blood of Mystra and corrupted it with the essence of the Shadowfell, enabling the creation of the Rapier of Dispelling.\n\nGaining many enemies from attacking the mighty Mystra, Fyrra was the primary reason that the Demigods seemed locked in their decision to create a new world, with followers of Mystra eager on their tails to take down the Demigods and destroy Fyrra's rapier.\n\nIn the year 1527 DY, Fyrra turned her back on the Demigods and declared that she would be leaving Dekatreis, for the safety of the people and the world itself. She would go somewhere \"out of the reach of magic and Mystra,\" and she was never heard from again, though many who share her hatred of magic seek worship in her, and recieve plentiful divine energy from wherever she may be."
        },
        {
          "name": "Kavara",
          "body": "Race: Dragonborn\nClass: Paladin\nStatus: Ascended, Goddess of Living Creatures and Equality\nDomains: Life, Forge, Nature\nAlignment: Neutral Good\n\nPerhaps the strongest physically of all the Demigods and the most intent on being a driving force of good for the entire world that they wished to create, Kavara began as a simple paladin with an oath to the cosmic forces themselves. Adoring the thought of conquesting in the name of creating peace and enabling stability between not only humanity but all races, she strived to do such while travelling with Alethra and the other original members of the group. It was Kavara who landed the final strike on one of their greatest enemies, the reincarnation of Tiamat herself that was resurrected by a mass gathering of cultists.\n\nAfterwards, when the idea was raised by Alethra and Aurae for the group to strive to create their own worlds, Kavara used the scales of Tiamat to begin crafting her Book of Creation. It wasn't until she made a deal with Lathander for a fraction of his power that she could create creatures from the book. Using the book, she could craft souls from the pages and give them bodies, effectively becoming one of the most powerful of the group in more than simply strength.\n\nWhile on Dekatreis, Kavara interacted well with all her creations, making sure peace was kept and that all knew that she created them with adoration. She gave boons to her people, the Dragonborn, giving them enhanced sight and a connection to the newly revived gem dragonkind. Additionaly, it was her who made the Petona, the Magia, and the Sun Elves, Moon Elves, as well as the Dark Elves at the request of the others to experiment with new races and bringing some old races from old history back. However, her most admirable feat was the creation of the Kathari, children for the Demigods who became sterile due to their intense exposure to magic that also granted the Demigods their immortality.\n\nKavara considered all the people of Dekatreis her children, though through the creation of Kathari, Kavara created and raised several children before her departure once the youngest grew to adulthood. On the year 1832 DY, she ascended to the plane of Arborea and became known among Dekatreis as the patron goddess of all living creatures, as well as the Goddess of Equality."
        },
        {
          "name": "Kaylessa",
          "body": "Race: Half-Elf\nClass: Bard\nStatus: Ascended, Goddess of Protection\nDomains: Life, Protection\nAlignment: Neutral Good\n\nThough not too much is directly recorded by Kaylessa herself, the stories told of her are many. Whether passed from generation to generation or written secondhand by the other Demigods, everyone had positive things to say about Kaylessa and how her voice could cure even the most ill and even remove curses from the damned. Alethra wrote that when she first approached the group to join them in their journeys, she showed them her abilities by singing, \"And when she began to sing, it was as if the divines themselves had blessed her, and that time began to rewind at her command, her voice that powerful.\" This, combined with her essential healing and revival powers, allowed her to easily be the heart of the group, holding connections to even Fyrra and Tyrae to make sure the group stayed together through everything.\n\nWhen Kaylessa obtained her weapon, she reached out to Sharindlar and, with the help of Vondal to get in the healing goddess' good graces, she was able to convince the divine power to allow her to take some of her magic and create the Ocarina of Healing and Protection. The artefact would amplify her powers and allow her to evoke the powers of healing and resurrection even if she was sapped of her natural magic. The most powerful ability of the artefact, however, was recorded to be a field that negated death--saving the group from a particularly harsh tri-breath attack from Tiamat herself. \"Without her artefact,\" Alethra recounts, then the group \"would have probably died right there.\"\n\nAfter adoringly watching over the people of Dekatreis, nursing the sick to health and teaching them medical practices, while raising spirits using her singing, she eventually ascended to the plane of Arcadia. She became widely worshipped as the Goddess of Protection, all people believing that Kaylessa would watch over those in need and lend them her power when in dire need."
        },
        {
          "name": "Keishara",
          "body": "Race: Yuan-ti\nClass: Warlock\nStatus: Unknown\nDomains: Trickery, Arcana\nAlignment: Lawful Evil\n\n"
        },
        {
          "name": "Loriella",
          "body": "Race: Gnome\nClass: Sorcerer\nStatus: In Toril\nDomains: Arcana, Forge, Love\nAlignment: Chaotic Neutral\n\n"
        },
        {
          "name": "Nasir Faemoss",
          "body": "Race: Aasimar\nClass: Druid\nStatus: Ascended, God of Curses\nDomains: Tempest, Light\nAlignment: Lawful Neutral\n\n"
        },
        {
          "name": "Rauvel Faemoss",
          "body": "Race: Aasimar\nClass: Paladin\nStatus: Trapped within the Astral Plan\nDomains: Death, Knowledge, Protection\nAlignment: Chaotic Neutral\n\n"
        },
        {
          "name": "Tyrae Valsh",
          "body": "Race: Drow\nClass: Rogue\nStatus: Trapped within the Shadowfell\nDomains: War, Chaos\nAlignment: Chaotic Evil\n\n"
        },
        {
          "name": "Vondal",
          "body": "Race: Dwarf\nClass: Sorcerer\nStatus: In Toril\nDomains: Forge, Love\nAlignment: Neutral Good\n\n"
        }
      ]
    }
  ]
}
