{
  "historyofdekatreis": [
    {
      "name": "History of Dekatreis",
      "sections": [
        {
          "name": "Races of Dekatreis",
          "body": "So, with the demigods having their artefacts and a means to get to Dekatreis, I had to plan out how it would progress from a water planet with a tiny island to being a fully fleshed out world with a variety of races, a lack of demigods, and a singular Queen to rule it all. I started with the basics: Creating life.\n\nOne of the 13 members was named Kavara, a dragonborn who was able to steal a god's ability to create life from nothing and merge it with a book. This book would become the artefact known as the Book of Creation, and she would be who would create the fantasy races I wished to have in my world. From humans, to dwarves, elves, halflings, tieflings, orcs, dragons, that one kraken... Yeah, Kavara had a lot of work, but she loved it all. This also allowed me to normalize pretty much every single race I could think of, from both Toril and any other settings I wished to take ideas from. With the Book of Creation, there was no limit.\n\nDuring this phase, I was also able to reason out new races that you'll find in this PDF down below: The Magia, the Petona, and the Kathari. These are all subraces of humans that were created with the Book of Creation. Curious to see the extent that they could manipulate life, the demigods convinced Kavara to put wings on a human. With enough tweaking, she gave humans flight in the forms of the Petona. Then they wished to put more magic inside a human from birth, like the innate magic of elves. She granted them random boons of magical energy that was attached to their blood, and these were called Magia.\n\nThen came the question: Could the demigods make their own children? The answer, Kavara came up with, was no. The book told her many things, and one of these things was all the magic that they had abused with their godly artefacts had corrupted their bodies, forcing them to never have children. But, Kavara did offer to create children for the demigods and their spouses. In order to set their children apart from all the other species, she would combine what she had done with the Petona and Magia, and she would combine them into one body, and give features from both parents to make it appear like their own. These, she decided, would be Kathari. Kathari would be the children of demigods who had the full ability to breed more Kathari, and with their powerful blood they would have wings and magic that surpassed the Magia's and Petona's capabilities."
        },
        {
          "name": "Creation of the Continents",
          "body": "Dekatreis quickly ran out of room on the tiny island within the first year. So, of course, another two artefacts helped remedy this. Vondal, a dwarf, had an artefact that allowed him to create land from nothing and, while this rose the sea levels, he could raise the land some to balance it all out. With the help of Nasir, who held the Heavenly Robes that allowed him to manipulate the weather before things turned chaotic from the sudden change in sea level and land mass, Vondal was able to create the continents until the demigods were happy. To add in variety, Loriella, a gnome, also helped re-shape the lands, adding in deserts, arctic areas, forests, and more--all using her own artefact, the Talisman of True Transmutation."
        },
        {
          "name": "Society Develops",
          "body": "After plenty of varieties of creatures were made, and the landmasses were properly designed, the only thing the demigods had to do was watch over their creation to see how it did. Kavara continued creating new species, all with their own free will but most choosing to worship the demigods as true gods for their ability to create such a vast and amazing world on their own. History books were made detailing all their feats and accomplishments, then it was transferred to digital servers with the help of Cecelia, who wielded a ring that could create any piece of technological equipment so long as she knew how the inner workings worked.\n\nWith the ring, Cecelia was also able to help the people make blueprints of all this technology, explain to them what resources they'd need, how to refine it all. They digitized all this information as well, giving them a running start on the techno-fantasy setting that I wanted to have in this setting. Technology and magic wouldn't compete, but it would grow together.\n\nSoon, cities began to spring up and a little bit of order was fashioned, but none of the demigods wished to create governments or help the mortals create them. They thought that would be overstepping boundaries when during the last thousand years, all they wanted to do was watch over and see how their creation did on its own."
        },
        {
          "name": "Departure of the Demigods",
          "body": "1500 years after the demigods had first stepped foot on the world of Dekatreis, and after seeing how far it had all grown and how far it had left to go, some of the demigods began to speak of leaving the physical aspect of the world. The first to go through with this was Tyrae Valsh, the drow that wielded an artefact called the Apple of Discordia. He stated that ever since the beginning, he wished to reach godhood, and he believed that creating a world would grant him such a right. However, despite a number of drow followers, he didn't find the divine power he sought through their worship. Thus, he vanished into the realms of the Shadowfell, and was from there never heard from again.\n\nAcross the next 1000 years, the rest of the demigods began to slowly depart for various reasons. Keishara claimed her own layer of the abyss, Loriella and Vondal went back to Faerun to be home together again, and many of the demigods actually ascended to godhood, such as Cecelia, who became the goddess of technology.\n\nThe last one to leave the world was Alethra Stormchild, the wielder of an artefact called the Staff of Pure Order. He had a Kathari child named Viessa, and after hiding away his staff, he told Viessa that she could find it and have rightful claim to all its power if she could retrieve it. If she could not, then he relayed to her his fear that the world might fall into chaos without the demigods on it."
        },
        {
          "name": "The Queen's Years Begin",
          "body": "Finally, we're back to the Queen, Viessa Stormchild. After going on a long string of adventures searching for her father's Staff of Pure Order, she eventually reached it and felt its power in her grasp. Immediately, she knew what the artefact could be used for. It had two abilities:\n\nOrder: Your very presence with this staff causes those who can hear or see you to trust you and follow your whim. You may utter a verbal component and any living or nonliving creature that can hear you is forced to believe or follow your utterences to the best of their abilities.\nUniversal Speech: Your voice booms through the head of every living, conscious creature in the material plane of the world. This penetrates magical barriers and anti-magic fields. You may reduce the radius of this effect using a specified range, such as 10 miles, or using a qualifier, such as the entire kingdom of Dekatreis.\n\nThe power that this staff had was almost corrupting, and recalling it, she began to realise why she had never seen her father with the staff in hand. However, she heard his last words in her head again, how the world could fall into chaos and tear itself apart without someone to guide it. So, with the power of the staff, she combined its two abilities. She spoke to the entire world at once, and forced them to obey. She ordered that she would be their Queen, and that there would be no resistance to her claim, as she was the child of Alethra Stormchild, and she had a right to bring the world into a new era of order."
        },
        {
          "name": "New Order",
          "body": "Viessa split the world into five kingdoms: Dekatreis, Sarille, Totara, Azor, and Akiira. She placed princes and princesses in control of each kingdom, and trusted them with maintaining order. To ensure this, she would regularly hold meetings between each of the princes and princesses, send diplomats from her court to check on their people, and she, herself, would go out and walk the streets of the kingdoms to interact with the commoners."
        },
        {
          "name": "War of the Five Elves",
          "body": "This went well for some years, until the War of the Five Elves began. You see, she put the Sun and Moon Elves--creations from the Book of Creation--in charge of Akiira, she put the Dark Elves in control of Sarille, and she put the Wood and High Elves in charge of Dekatreis. These elf groups made efforts to be interconnected and promised each other to share magical research and discoveries with each other no matter what. However, it all fell apart when word reached Dekatreis that the leader of Sarille had obtained an artefact, and had kept it a secret.\n\nThe Prince of Sarille one day found spies in his tower attempting to gain information on this supposed artefact. In fury, he brought the Dekatrian spies out in front of his tower and executed them both, declaring the pact between the three kingdoms 'destroyed' and putting full blame on Dekatreis. Dekatreis quickly declared war on Sarille, and Akiira joined the war shortly later on the side of Dekatreis.\n\nDuring this time, the Queen had left her tower on a mission, and so she was unaware as this war waged on between the three middle kingdoms. Dirty tactics were employed by Sarille, as the Prince finally revealed which artefact he had: Discordia's Apple.\n\nWith Discordia's Apple, the Prince of Sarille was able to \"take a bite out of this regenerative apple and speak a verbal component that is under 25 words. All creatures that hear these words spoken, even by second hand, are compelled to see these words as the truth. If it is a command, they must follow the command to the best of their abilities, becoming otherwise mindless until the attunement to the apple ends.\" With this power, the Prince took a bite of the apple and told his men that no one should trust the rulers of Akiira, that the Sun and Moon Elves were simply putting their own territory into a crisis and that they had no right to be in the war in the first place. However, when word reached the ears of the Akiirans, something much more grave happened than just forcing Akiira to step out of the war.\n\nThe common people of Akiira turned on their leaders as the words were spread rapidly across the territory, and not only their leaders, but the Sun and Moon Elf races themselves. Over the course of five years, Akiira was brought into absolute chaos, and the Sun and Moon Elves were slaughtered to near extinction with very few escaping the minds corrupted by Discordia's Apple.\n\nWith Akiira in shambles, Sarille was able to put all of their focus on fighting their war against Dekatreis, but they were still taking heavier losses than their counterpart. The Prince of Sarille took another bite of the apple, and repeated the same corrupting message to be sent to Dekatreis. Before long, the commoners of Dekatreis began to second guess their leaders as well, but not before the Queen returned and, with fury in her gaze, ordered all the princes and princesses--save for Akiira's, who had been murdered by their own people--to her court."
        },
        {
          "name": "Aftermath of the War",
          "body": "After a speedy trial, the Prince of Sarille had his artefact taken from him by force, ending his attunement before the kingdom of Dekatreis fell into as much chaos as Akiira had fallen into. The Queen locked the artefact in her vault, making sure it could not be abused any more. Afterwards, she locked the Prince in a prison below her tower on Queen's Island, where not a soul heard from him again.\n\nFrom there, she surveyed Akiira and realised that there was no saving the kingdom. The chaos it had been put through left the land magically corrupted, with portals to other planes conjuring from nothing and terrifying creatures of twisted forms attacking anything that dared get close to them.\n\nDuring Sarille's war, a foreigner had gained popularity among the non-Dark Elves of Sarille, encouraging them to stage an uprising to end the war. By the time they were about to go through with their plans, however, the Queen had ended the war herself, and now the throne was empty. The foreigner was named Thallan Pesthana, and used her influence to convince the Queen that she would make a good next ruler for the kingdom. Many of the Dark Elves had been excommunicated from society, pushed away due to what the Dark Elf Prince had done. Many began to shame the population with the word \"Drow,\" harassing them and sometimes using violence until many of the Dark Elves took seclusion in setting up their own cities to hide away from all the hatred the other races had gained for them. Though Dekatreis did not have typical Drow at the time, they were called such until one day the influence of Lolth swept in and she began to corrupt the world's Dark Elves as well."
        }
      ]
    }
  ]
}
