{
  "presentdays": [
    {
      "name": "Present Days",
      "sections": [
        {
          "name": "The Queen",
          "body": "After the War of the Five Elves, the Queen backed away and became more secluded. She feared against using the Staff again to restore order after seeing what chaos the apple had brought, and had faith that those she had put into power could manage themselves. Her visits to the kingdoms kept up for a few hundred years, but in time she began to visit the commoners less and less frequently."
        },
        {
          "name": "The Azorian Empire and Azoranthium",
          "body": "During the year 906 of the Queen's Years, Azor, a kingdom that controlled both the Northern and the Southern tips of the world of Dekatreis, began to break into factions. South Azor celebrated free speech and a relaxed style of government, while the other, North Azor, wished to restrict freedom and ensure that its subjects were closely monitored with the use of cameras and other technology to control how its people spoke and moved to ensure safety to the kingdom and its people.\n\nAfter a declaration of independence, South Azor became \"Azoranthium,\" while North Azor became the \"Azorian Empire.\" Within a year of the war's start, the Queen called both leaders of these factions to her court, and after a long argument, she proclaimed that the two kingdoms would from then on be separate, much to the Azorian Empire's Prince's anger. The Queen also allowed the faction ruler of Azoranthium to become the Prince of Azoranthium with her blessing. The two kingdoms still hold resentment for each other, and naval battles between the two are not uncommon, but full-out war has not gone on for many years."
        },
        {
          "name": "Sarille",
          "body": "Thallan Presthana made good on her promise to oversee the kingdom of Sarille, making many changes throughout her rule. Seeing the gods' influence as detrimental to the good of the world, she outlawed all worship of anyone but herself, the Queen, and the thirteen demigods. Under these terms, anyone seen to have an amulet to Lathander, or to be openly praying to any other deity, would be thrown in jail until they rejected their worship of those deities.\n\nThallan also readily embraced a growing population of undead in her kingdom. She created laws that protected vampires and liches from those that might slay them, as well as making sure that their undead servants--so long as they weren't harming anyone--could be out in public without fear of being attacked.\n\nWith the help of having the undead in her favour, she sparked fear in the hearts of any who would oppose her, allowing her to enact other laws of totalitarian nature, such as implementing security cameras, under-the-skin chips that are required at birth that would track the movements and health of all individuals, and robotic guardsmen that she had developed to ensure peace across the kingdom's cities."
        },
        {
          "name": "Totara",
          "body": "Totara, the desert kingdom, had always stayed out of trouble with the Queen and its own people. They were very accepting of outsides into their harsh lands, lead by a ruler by the name of Xythian Rarazydin, one of the grandchildren of the Queen herself. Xythian's moral code throughout his rule had always been to ensure everyone had just enough to survive--and more if they could ever afford it.\n\nHis faith centred around worshiping the Demigods and all the territory in their kingdom. Each grain of sand was precious, each oasis was a blessing, the plants, animals and other beings that could survive--the few that could--were kin and spiritually connected to each other. They all knew they had come from the Book of Creation in some ancestry, leaving Xythian and his tribesmen to feel as if they were all family with all others on the planet."
        },
        {
          "name": "Akiira",
          "body": "Akiira was left in ruins after the War of the Five Elves. The absolute genocide of the Sun and Moon Elves that was brought upon the lands from the Apple of Discordia's usage made their blood mix with the soil. Not only that, but countless other spells were used to try and combat the artefact's power, to no avail, scarring the land with various powerful magics made out of desperation.\n\nToday, Akiira is but a chaotic land of anarchy, home to treasure hunters and glory seekers who wish to go into the wilds and overrun towers to retrieve items of old and fight beasts that have become corrupted by the land's magic. Few have managed to set up a \"city\" of protection for incoming adventurers. This city, named Kamimagi, became a home to those who dare to challenge the wild lands of Akiira whenever they're preparing for expeditions. The city is surrounded with an anti-magic wall to prevent the creatures of the corrupted land from attacking the city.\n\nAll must be careful, however, as all the corrupted magical land has made a perfect home for portals to other planes. A common traveler through Akiira might find themselves in the Shadowfell one day, escape back to Akiira, and then get stolen away to the plane of Mechanus before they're able to leave the once glorious kingdom. The only safe place on Akiira from this is Kamimagi."
        },
        {
          "name": "Dekatreis",
          "body": "After the War of the Five Elves, the Queen decided to put one of her children in charge of the land. The first ruler post-war was named Adrian Stormchild. He ruled justly and became responsible to inhabiting much of the mountainous ranges of Dekatreis, finding that they were just as suitable for cities as the forests were. He even moved the capital to where it stands still hundreds of years later.\n\nAfter some years of rule, Adrian has his life saved during a battle with a ferocious red dragon by a powerful griffon. The strength and magical power of the beast gained Adrian's respect tenfold, and in return for saving his life, Adrian pushed into law that griffons were to from thereon be considered sacred animals in the realm of Dekatreis, not to be hunted or attacked unless in self-defense.\n\nThe griffon that saved Adrian then re-found the Dekatrian ruler and declared that his name was Antheia, and that what Adrian did had gathered the powerful griffon's adoration. As the sacred animals of Dekatreis, Antheia offered the service of griffons should the royalty of Dekatreis ever require protection, which Adrian accepted. In addition, the griffon granted Adrian a boon, a portion of his magic, turning Adrian into the first Griffonblood Sorcerer.\n\nAdrian's bloodline from there on gained the name Griffonblood, and the griffons remained royal to the Griffonbloods.\n\nThe current two rulers of Dekatreis are Adrian's daughters, Rasha and Zella Griffonblood, who seek to push freedom and happiness for their people before anything. They set up an adventuring guild after reports declared that there was not enough work in the kingdom to keep families with a stable income. The adventuring guild was named the \"House of Tessera,\" and networks were made with help of the princesses to establish guilds in all cities of Dekatreis.\n\nAlong with the House of Tessera, Zella opened the princess' tower to the public, allowing any and everyone to come bring their issues to the princesses whenever they wished, and the princesses would listen and try to resolve issues as they could. This gained widespread positive opinion and allowed their people to prosper with the ever-evolving help of the princesses."
        }
      ]
    }
  ]
}
