{
  "sarille": [
    {
      "name": "Sarille",
      "sections": [
        {
          "name": "General Knowledge",
          "body": "The whole of the world has Sarille to thank for many things: In the young years of the Queen's rule, Sarille was the primary trader of magical secrets and held the greatest mining facilities. Their ability to tap into the mountain ranges with their keen sight allowed them to uncover natural resources better than all the other kingdoms, building up quick technological and societal advancement in many ways. After being accused of hiding a Demigod artefact away from the other kingdoms and starting the War of the Five Elves by executing a Dekatrian spy, the kingdom began its descent into earning the ire of all those outside Sarille.\n\nDuring the imprisonment by the Queen after the royal trial, a new ruler was chosen to rule the once-prosperous Dark Elf land. Many non-Dark Elves of the kingdom had during the war began to rally behind a woman named Thallan Presthana, and the influence over millions of followers enabled to Queen to justly pronounce Thallan as the new Princess of Sarille. After her coronation, Thallan began to rapidly shift the society, enabling its darker attitude rather than shun it. Necromancy was greatly encouraged to do jobs that would usually risk the lives of Sarille's citizens, enabling mining operations to have much more prosperous endeavors.\n\nTheir already well-built technological infrastructure pushed Thallan to make the first national ID system, and with the help of the kingdom of Azor, she placed facial recognition on every single one of her construct guards and registered everyone who passed through Sarille's cities into her database. The national ID system, in time, was adopted by other kingdoms, but the facial recognition was scorned by all but Sarille and what would become the Azorian Empire. Not only enabling necromancy and mass surveillance, Thallan pushed for full adoption of necromantic magics in her kingdom to be fully realised as a school of magic. Using the national system, she allowed people to consent to their body's use after death to supply necromancers with, putting the raising of zombies in a much better light due to people not needing to harvest the corpses of the unwilling."
        },
        {
          "name": "Thallan Presthana",
          "body": "Thallan gained dominant popularity over the non-Dark Elves of Sarille after coming from Akiira and promising an greater ruler, one that wouldn't provoke needless battle and would send the whole kingdom into a greater realm of prosperity than they had even before the war. In time, she would reveal that she was born of another plane, and after traversing through the Shadowfell, she ended up learning of Dekatreis through a great being that passed onto her knowledge that would supply her rule. Her charismatic personality and inherent strength allowed her to assert rule over any who would dare question her, though she respected the Queen greatly.\n\nUsing necromantically raised servants for most things in her daily life and encouraging the same throughout all of Sarille, her rule manifests itself as ruthless and tactical, oversurging with wealth and propserity from the monopoly her kingdom has on raw materials. In addition, she has made much of the mineal work done in Sarille supplied by undead and constructs. She maintains support by offering high quality social services funded by the kingdom directly, everything from shelter, medicine, and entertainment, as well as practicing regular public appearances through events and games to give her plenty of direct interaction with her populace.\n\nHer biggest supporters, however, seem to come from the intelligent undead that are labelled as a protected minority under the Sarille government. From liches to vampires, the bordering kingdoms of Dekatreis and Totara both vocally disagree with the rampant unnatural extensions of people's lives, even though she readily assures that the undead of her kingdom are \"good-natured\" and that they are closely regulated.\n\nIn addition, Thallan has plentiful enemies in the forms of worshipers of non-Demigods. A few hundred years after she began ruling, she had laws put into place banning all non-Demigod worship except for herself. Years after that, she also placed into effect a law that forced every school to teach worship of Thallan Presthana as divine-blooded. Gathering a plentiful amount of worshipers, whether out of true reverence or merely fear, Thallan placed herself beside her mother and directly below all the Demigods as the most worshiped entity in Sarille."
        }
      ]
    }
  ]
}
