{
  "totara": [
    {
      "name": "Totara",
      "sections": [
        {
          "name": "General Knowledge",
          "body": "Once a grand desert empire that manifested to the south of Sarille, Totara largely remained out of the conflicts of the world but their environment lead to only the most durable and hopeful of people surviving on to foster the future generations. At its worst, Totara's capital city, The Golden Crown, was overrun with manifestations of monsters none had ever seen before. In attempts to preserve their people, they were forced to settle nowhere.\n\nThe shining beacon of the desert was transformed into little more than a loose grouping of tribes spanning across the entire subcontinent. The biggest tribe held the Prince, a lizardfolk by the name of Azshara, up until his untimely death protecting his tribe.\n\nAs Azshara had no heir and the rules to decide a new heir were uncertain, a message was sent to the Queen. While it was being delivered, the shattered tribes grew restless and began to fight in the name of asserting dominance over one another, hoping that they would be able to re-combine all the tribes under one leader one again and fight back the monstrosities that forced them to be constantly on the move in the first place, to one day take root in the once-grandd Golden Crown again."
        },
        {
          "name": "Xythian Rarazydin",
          "body": "During the chaotic wars between each of the tribes, one of the Queen's grandsons, Xythian Rarazydin, had been travelling through the desert lands when he stumbled upon the fighting of several tribes. Seeing the people of Totara dye the sand with the blood of their own kinsmen, he saw to it that he would be the one to bring them to peace once more. Immediately he got to work, disassembling the fights with a variety of diplomacy, shows of power, and raw force of will, yet not a single life was lost by his hands as was his promise to the people when he first announced his presence.\n\nIn return for his dismantling of the conflicts and allowing a temporary peace to befall the great desert, Xythian was nominated by the tribes to be the new Prince of Totara. Without even waiting for his mother's approval, as she had been missing, he began building relationships with the other kingdoms and sought to supply his people with at least the minimum to survive.\n\nIn time, the Queen resurfaced and called an end to the War of the Five Elves, which had been going on to the north of Totara. Xythian announced himself as the newly settled Prince of Totara during the royal court trial that decided the fate of the Drow Prince. The Queen, hearing of her grandson's great accomplishments and entrusting him to lead the people of Totara, approved of his ascension.\n\nSince then, Xythian's presence has enabled the kingdom of Totara to create a great span of ties between the other kingdoms. Trading of raw materials from Sarille in exchange of precious fruit and animal parts only native to Totara's deserts, as well as a healthy diplomatic relationship supporting the kingdoms of Dekatreis and Azoranthium, much to the displeasure of the Azorian Empire."
        }
      ]
    }
  ]
}
