{
  "kitsune": [
    {
      "name": "Kitsune",
      "sections": [
        {
          "name": "Kitsune Background",
          "body": [
            {
              "name": "Background Details",
              "body": "Kitsune are strongly tied to the magic that lies within their blood and particularly their tails. Made by Kavara like all other races on Dekatreis, the Kitsune were once praised as the greatest spellcasters of the world, some even being believed to have a direct connection to the Weave itself. However, after the Demigods departed the world and societies began to grow more greedy, many other magically-inclined creatures began to hunt the Kitsune down to chop off their tails in use for various spells, potions, and powerful rituals. Despite the protections put up for the Kitsune in various kingdoms, the Kitsune Hunters that readily made profit off Kitsune tails overwhelmed the species until they began to use their magic to go into hiding."
            }
          ]
        },
        {
          "name": "Kitsune Traits",
          "body": [
            {
              "name": "Hit Points",
              "body": "6"
            },
            {
              "name": "Size",
              "body": "Medium"
            },
            {
              "name": "Speed",
              "body": "25 feet"
            },
            {
              "name": "Ability Boosts",
              "body": "Charisma, Dexterity, Free"
            },
            {
              "name": "Ability Flaw",
              "body": "Strength"
            },
            {
              "name": "Languages",
              "body": "Common, Sylvan"
            },
            {
              "name": "Bonus Languages",
              "body": "At 1st level, if your Intelligence score is 14 or higher, you can also select one of the following languages: Choose from Elvish, Gnomish, Halfling, Orcish, Undercommon, and any other languages to which you have access."
            },
            {
              "name": "Magical Tails",
              "body": "Kitsune were created through empowering humans with fox-like tails that hold their power, allowing them to grow stronger the longer their lives go on. A Kitsune starts their life with a single tail, which grants them a small sample of their ancestry's magical affinity. When you select your heritage, you gain an innate magical tradition. Your innate magical tradition gives you Trained proficiency in a listed skill, a cantrip associated with the magical tradition, and affects the types of spells that the Kitsune recieves when they grow new tails. Kitsune grow a new tail and gain a new spell along with it at every odd level, starting at 3rd, ending with their 9th tail at 17th level.\n\nYou cast the cantrip received as an innate spell at will. A cantrip is heightened to a spell level equal to half your level rounded up. However, spells that are 1st level and above may only be cast once per day at their lowest level, counting as an innate spell of your magical tradition granted by your heritage."
            }
          ]
        },
        {
          "name": "Arcane Tails",
          "book": "[Kitsune] [Heritage] [Arcane]",
          "body": [
            {
              "name": "Arcane Magic",
              "body": "Arcane Kitsune tend to be the traditional trickster in society. They will typically play pranks and alter people's emotions or perceptions of them in the spirit of a good joke. You become trained in the Arcana skill and gain spells from the Arcane Tails Magic table, starting with Dancing Lights at 1st level."
            },
            {
              "name": "Arcane Tails Magic Table",
              "style": "table",
              "body": [
                [
                  "Character Level",
                  "Spell",
                  "Spell Level"
                ],
                [
                  "1",
                  "Dancing Lights",
                  "Cantrip"
                ],
                [
                  "3",
                  "Illusory Disguise",
                  "1"
                ],
                [
                  "5",
                  "Charm",
                  "1"
                ],
                [
                  "7",
                  "Blur",
                  "2"
                ],
                [
                  "9",
                  "Invisibility",
                  "2"
                ],
                [
                  "11",
                  "Suggestion",
                  "3"
                ],
                [
                  "13",
                  "Blink",
                  "4"
                ],
                [
                  "15",
                  "Subconscious Suggestion",
                  "5"
                ],
                [
                  "17",
                  "Dominate",
                  "6"
                ]
              ]
            },
            {
              "name": "Arcane Ancestry Feats",
              "body": "Additionally, you may select Kitsune ancestry feats with the Arcane Heritage requirement."
            }
          ]
        },
        {
          "name": "Primal Tails",
          "book": "[Kitsune] [Heritage] [Primal]",
          "body": [
            {
              "name": "Primal Magic",
              "body": "Primal kitsune are more in-tune with the natural world and while still adept at playing pranks, instead use the world to their advantage while letting go to their instincts when it comes to confrontation. You become trained in the Nature skill and gain spells from the Primal Tails Magic table, starting with Tanglefoot at 1st level."
            },
            {
              "name": "Primal Tails Magic Table",
              "style": "table",
              "body": [
                [
                  "Character Level",
                  "Spell",
                  "Spell Level"
                ],
                [
                  "1",
                  "Tanglefoot",
                  "Cantrip"
                ],
                [
                  "3",
                  "Magic Fang",
                  "1"
                ],
                [
                  "5",
                  "Alarm",
                  "1"
                ],
                [
                  "7",
                  "Speak with Animals",
                  "2"
                ],
                [
                  "9",
                  "Faerie Fire",
                  "2"
                ],
                [
                  "11",
                  "Earthbind",
                  "3"
                ],
                [
                  "13",
                  "Freedom of Movement",
                  "4"
                ],
                [
                  "15",
                  "Tree Stride",
                  "5"
                ],
                [
                  "17",
                  "Tangling Creepers",
                  "6"
                ]
              ]
            },
            {
              "name": "Primal Ancestry Feats",
              "body": "Additionally, you may select Kitsune ancestry feats with the Primal Heritage requirement."
            }
          ]
        },
        {
          "name": "Divine Tails",
          "book": "[Kitsune] [Heritage] [Divine]",
          "body": [
            {
              "name": "Divine Magic",
              "body": "Divine kitsune prefer to act in their good hearts and in the best interest of all those around them, using their magic to buy time to let another escape or to otherwise assist through other divine magics. You become trained in the Religion skill and gain spells from the Divine Tails Magic table, starting with Stabilize at 1st level."
            },
            {
              "name": "Divine Tails Magic Table",
              "style": "table",
              "body": [
                [
                  "Character Level",
                  "Spell",
                  "Spell Level"
                ],
                [
                  "1",
                  "Stabilize",
                  "Cantrip"
                ],
                [
                  "3",
                  "Ventriloquism",
                  "1"
                ],
                [
                  "5",
                  "Spirit Link",
                  "1"
                ],
                [
                  "7",
                  "Calm Emotions",
                  "2"
                ],
                [
                  "9",
                  "Status",
                  "2"
                ],
                [
                  "11",
                  "Dream Message",
                  "3"
                ],
                [
                  "13",
                  "Air Walk",
                  "4"
                ],
                [
                  "15",
                  "Drop Dead",
                  "5"
                ],
                [
                  "17",
                  "True Seeing",
                  "6"
                ]
              ]
            },
            {
              "name": "Divine Ancestry Feats",
              "body": "Additionally, you may select Kitsune ancestry feats with the Divine Heritage requirement."
            }
          ]
        },
        {
          "name": "Occult Tails",
          "book": "[Kitsune] [Heritage] [Occult]",
          "body": [
            {
              "name": "Occult Magic",
              "body": "Occult kitsune are seen primarily as the most sinister type of trickster, their jokes dark and more harmful than any other. Whether it be apathy for another's safety or sensing a desire to inflict harm to another, their magic aids them to do either. You become trained in the Occultism skill and gain spells from the Occult Tails Magic table, starting with Ghost Sound at 1st level."
            },
            {
              "name": "Occult Tails Magic Table",
              "style": "table",
              "body": [
                [
                  "Character Level",
                  "Spell",
                  "Spell Level"
                ],
                [
                  "1",
                  "Ghost Sound",
                  "Cantrip"
                ],
                [
                  "3",
                  "Illusory Disguise",
                  "1"
                ],
                [
                  "5",
                  "Fear",
                  "1"
                ],
                [
                  "7",
                  "Paranoia",
                  "2"
                ],
                [
                  "9",
                  "Telekinetic Maneuver",
                  "2"
                ],
                [
                  "11",
                  "Blindness",
                  "3"
                ],
                [
                  "13",
                  "Nightmare",
                  "4"
                ],
                [
                  "15",
                  "Crushing Despair",
                  "5"
                ],
                [
                  "17",
                  "Mislead",
                  "6"
                ]
              ]
            },
            {
              "name": "Occult Ancestry Feats",
              "body": "Additionally, you may select Kitsune ancestry feats with the Occult Heritage requirement."
            }
          ]
        },
        {
          "name": "Kitsune Ancestry Feats",
          "body": [
            {
              "name": "Ancestry Feats",
              "body": "At 1st level, you gain one ancestry feat, and you gain an additional ancestry feat every 4 levels thereafter (at 5th, 9th, 13th, and 17th level). As a Kitsune, you select from among the following ancestry feats."
            },
            {
              "name": "Kitsune Ancestry Feats Table",
              "style": "table",
              "body": [
                [
                  "Name",
                  "Requirements",
                  "Description"
                ],
                [
                  "Spiritual Companion",
                  "1st Level",
                  "You build a spiritual connection with an animal, which becomes magically bonded to you. You gain a familiar using the rules on page 217. The type of animal is up to you, but most Kitsune choose animals with a tail."
                ],
                [
                  "Fox Shape",
                  "1st Level",
                  "You gain the ability to shapechange into a small, harmless fox, as per the Pest Form spell. However, the duration of the spell when you use this ability is permanent until dismissed, and your size is Small or Medium, your choice."
                ],
                [
                  "Split Personality",
                  "1st Level",
                  "You gain the ability to simply disguise as a member of another race as per the Humanoid Form spell. However, the duration of the spell when you use this ability is permanent until dismissed, and your form is always the same."
                ],
                [
                  "Vengeful Hatred",
                  "1st Level",
                  "You heart aches for vengeance against those who have wronged your people. There was a period of time where Kitsune hunters were common throughout the world--cutting off their tails for use in magic spells or to otherwise harness the magic within them. Choose one of the following kitsune ancestral foes when you gain Vengeful Hatred: human, elf, dwarf, dragonborn, and lich. You gain a +1 circumstance bonus to damage with weapons and unarmed attacks against creatures with that trait. If your attack would deal more than one weapon die of damage (as is common at higher levels than 1st), the bonus is equal to the number of weapon dice or unarmed attack dice.\n\nYour GM can add appropriate creature traits to the ancestral foes list if your character is from a community that commonly fights other types of enemies."
                ]
              ]
            }
          ]
        }
      ]
    }
  ]
}
