{
  "tiefling": [
    {
      "name": "Tiefling",
      "sections": [
        {
          "name": "Tiefling Background",
          "body": [
            {
              "name": "Background Details",
              "body": "Simultaneously more and less than mortal, tieflings are the offspring of humans and fiends. With otherworldly blood and traits to match, tieflings are often shunned and despised out of reactionary fear. Most tieflings never know their fiendish sire, as the coupling that produced their curse occurred generations earlier. The taint is long-lasting and persistent, often manifesting at birth or sometimes later in life, as a powerful, though often unwanted, boon. Despite their fiendish appearance and netherworld origins, tieflings have a human’s capacity of choosing their fate, and while many embrace their dark heritage and side with fiendish powers, others reject their darker predilections. Though the power of their blood calls nearly every tiefling to fury, destruction, and wrath, even the spawn of a succubus can become a saint and the grandchild of a pit fiend an unsuspecting hero."
            }
          ]
        },
        {
          "name": "Tiefling",
          "book": "[Universal] [Heritage] [Tiefling]",
          "body": [
            {
              "name": "Tiefling Heritage",
              "body": "You have been cursed, either by blood or through dealing with a devil, and now bare the resemblance of the creatures from the Nine Hells. Growing a tail, horns, your skin a colour very different from your normal race--you are seen as an outcast by many, evil by some, and capable of being redeemed by others. You gain darkvision, though your vision appears red-tinted while in pure darkness."
            },
            {
              "name": "Tiefling Ancestry Feats",
              "body": "Additionally, you may choose Ancestry feats from your ancestry or the list of Tiefling feats."
            }
          ]
        },
        {
          "name": "Tiefling Ancestry Feats",
          "body": [
            {
              "name": "Ancestry Feats",
              "body": "At 1st level, you gain one ancestry feat, and you gain an additional ancestry feat every 4 levels thereafter (at 5th, 9th, 13th, and 17th level). As a Tiefling, you select from among the following ancestry feats, in additional to all usual ancestry feats from your ancestry."
            },
            {
              "name": "Ancestry Feats Table",
              "style": "table",
              "body": [
                [
                  "Name",
                  "Requirements",
                  "Description"
                ],
                [
                  "Devilish Resistance",
                  "Tiefling Heritage, Level 1",
                  "Born of devils innate to the harshest layers of the Nine Hells, your skin has been given traits from your ancesors. Pick one of the following damage types: Cold, Fire, Acid. You gain resistance to the selected damage type equal to half your level (minimum 1).\n\nSpecial: You may pick this feat multiple times, selecting a new damage type each time."
                ],
                [
                  "Hellish Vengeance",
                  "Tiefling Heritage, Level 1",
                  "You heart aches for vengeance against those who have wronged your ancestors. Choose between the Celestial or Demon traits. You gain a +1 circumstance bonus to damage with weapons and unarmed attacks against creatures with that trait. If your attack would deal more than one weapon die of damage (as is common at higher levels than 1st), the bonus is equal to the number of weapon dice or unarmed attack dice.\n\nYour GM can add appropriate creature traits to the ancestral foes list if your character is from a community that commonly fights other types of enemies."
                ],
                [
                  "Fiery Retaliation",
                  "Tiefling Heritage, Level 5",
                  "Your bloodshed can cause power to immediately retaliate against your foes. You gain the Hellish Rebuke spell. You can cast this spell as a divine innate spell once per day. This spell is heightened to a spell level equal to half your level rounded up."
                ]
              ]
            },
            {
              "name": "Hellish Rebuke",
              "book": "Reaction",
              "body": "Trigger: Being damaged by a foe within 60 feet of you that you can see.\nYou launch a bolt of fire at your opponent, dealing 2d6 fire damage. The creature must make a basic Reflex saving throw.\nHeightened (1st): Add 1d6 to the damage dealt."
            }
          ]
        }
      ]
    }
  ]
}
