{
  "heropoints": [
    {
      "name": "Hero Points",
      "sections": [
        {
          "name": "Basic Information",
          "body": [
            {
              "name": "Gaining Hero Points",
              "body": "Each session, characters start with 1 Hero Point they may spend for a benefit at any time. Hero Points might also be awarded for particularly heroic and risky deeds or the completion of important events or adventures. A character may not have more than 3 Hero Points at any time, and all hero points that weren't spent are lost at the end of a session."
            },
            {
              "name": "Using Hero Points",
              "body": "Each session characters start the session with 1 Hero Point they may spend for a benefit at any time. Hero Points might also be awarded for particularly heroic and risky deeds or the completion of important events or adventures. A character may not have more than 3 Hero Points at any time, and all hero points that weren't spent are lost at the end of a session."
            },
            {
              "name": "1 Hero Point",
              "body": "• Gain advantage on attack, ability check or save.\n• Impose disadvantage on an enemy save against one your spells or abilities.\n• Impose disadvantage on an enemy attack or ability check used against you.\n• Any other effect in-line with these uses, at the GMs discretion.\n• Automatically stabilize or prevent Instant Death."
            },
            {
              "name": "2 Hero Points",
              "body": "• Regain the uses of one ability as though you had taken a short rest. You don’t gain any other benefits of a short rest.\n• Spend hitdice to regain hitpoints as if you had taken a short rest."
            },
            {
              "name": "3 Hero Points",
              "body": "• Take an additional turn.\n• Regain the uses of one ability as though you had taken a long rest. You don’t gain any other benefits of a long rest.\n• Regain a spell slot of 5th level or lower."
            }
          ]
        }
      ]
    }
  ]
}
