{
  "dragonborn": [
    {
      "name": "Dragonborn",
      "sections": [
        {
          "name": "Dragonborn Background",
          "body": [
            {
              "name": "Background Details",
              "body": "The Dragonborn were on the old world, before the Demigods came to Dekatreis. The wielder of the Book of Creation, Kavara, was a Dragonborn herself. When she made her people on Dekatreis, she granted them special boons as a token to her heritage, and expanded their bloodlines as well."
            }
          ]
        },
        {
          "name": "Dragonborn Traits",
          "body": [
            {
              "name": "Ability Score Increase",
              "body": "Your Strength score increases by 2, and your Charisma or Wisdom score increases by 1."
            },
            {
              "name": "Age",
              "body": "With the Book of Creation, Kavara granted the Dragonborn increased longevity. Young dragonborn grow quickly and reach adulthood by 15, and live to be around 200 years old."
            },
            {
              "name": "Alignment",
              "body": "Dragonborn on Dekatreis are loyal to their bonds and most actively worship the Creator, Kavara, who was a dragonborn herself. Thus, many respect her beliefs that all creatures should live together and no one race is above another, though hunting and wars for territory is still fair game. They tend towards Lawful and Neutral stances, but some who resent Kavara and turn towards Kako's influence will be of a more Chaotic nature."
            },
            {
              "name": "Size",
              "body": "Dragonborn are taller and hevaier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is medium."
            },
            {
              "name": "Speed",
              "body": "Your base walking speed is 30 feet."
            },
            {
              "name": "Languages",
              "body": "You can speak, read, and write Common and Draconic."
            },
            {
              "name": "Darkvision",
              "body": "Kavara's final gift to the Dragonborn became the ability to see through the long nights of Dekatrian moons. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can discern color in darkness, unlike many other races."
            },
            {
              "name": "Draconic Ancestry",
              "body": "You have draconic ancestry. Choose from the Draconic Ancestry table. This will be used to determine your breath weapon's effects and your elemental resistance."
            },
            {
              "name": "Elemental Resistance",
              "body": "You have resistance to the damage type associated with your draconic ancestry."
            },
            {
              "name": "Breath Weapon",
              "body": "You can use your action to exhale destructive energy. Your draconic ancestry determines the damage type of the exhalation.\n\nWhen you use your breath weapon, each creature in a 15 foot cone of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.\n\nAfter you use your breath weapon, you can’t use it again until you complete a long rest."
            }
          ]
        },
        {
          "name": "Draconic Ancestry Tables",
          "body": [
            {
              "name": "Metallic, Gem, and Chromatic",
              "body": "During the creation of Dekatreis, and more importantly the creation of dragons, there became three gods that were worshiped across dragonkind. Kalos, the patron of good-aligned dragons. Oudeteros, the patron of neutral-aligned dragons. Then, finally, Kako--the root of all evil among dragons. Dragons are complex, intelligent creatures that are well-respected by humanity; however, the corruption of Kako is universally detested amongst all but those who give in to her and begin to impose her will on the world."
            },
            {
              "name": "Metallic Dragon Ancestry",
              "style": "table",
              "body": [
                [
                  "Dragon Species",
                  "Damage Type",
                  "Saving Throw"
                ],
                [
                  "Brass",
                  "Fire",
                  "Dexterity"
                ],
                [
                  "Copper",
                  "Acid",
                  "Constitution"
                ],
                [
                  "Silver",
                  "Cold",
                  "Constitution"
                ],
                [
                  "Gold",
                  "Radiant",
                  "Dexterity"
                ],
                [
                  "Electrum",
                  "Poison",
                  "Constitution"
                ],
                [
                  "Platinum",
                  "Lightning",
                  "Dexterity"
                ]
              ]
            },
            {
              "name": "Gem Dragon Ancestry",
              "style": "table",
              "body": [
                [
                  "Dragon Species",
                  "Damage Type",
                  "Saving Throw"
                ],
                [
                  "Amethyst",
                  "Force",
                  "Strength"
                ],
                [
                  "Crystal",
                  "Radiant",
                  "Constitution"
                ],
                [
                  "Emerald",
                  "Bludgeoning",
                  "Strength"
                ],
                [
                  "Sapphire",
                  "Psychic",
                  "Wisdom"
                ],
                [
                  "Topaz",
                  "Necrotic",
                  "Constitution"
                ],
                [
                  "Obsidian",
                  "Fire",
                  "Dexterity"
                ]
              ]
            },
            {
              "name": "Chromatic Dragon Ancestry",
              "style": "table",
              "body": [
                [
                  "Dragon Species",
                  "Damage Type",
                  "Saving Throw"
                ],
                [
                  "Red",
                  "Fire",
                  "Dexterity"
                ],
                [
                  "Blue",
                  "Lightning",
                  "Dexterity"
                ],
                [
                  "Black",
                  "Acid",
                  "Dexterity"
                ],
                [
                  "White",
                  "Cold",
                  "Constitution"
                ],
                [
                  "Green",
                  "Poison",
                  "Constitution"
                ],
                [
                  "Purple",
                  "Psychic",
                  "Intelligence"
                ]
              ]
            }
          ]
        }
      ]
    }
  ]
}
