{
  "vampire": [
    {
      "name": "Vampire",
      "sections": [
        {
          "name": "Vampire Background",
          "body": [
            {
              "name": "Background Details",
              "body": "Vampires are undead humanoid creatures that feed on the blood of the living. On Dekatreis, they were created through a gruesome mixture of undeath and living flesh and organs, allowing them a mixture of the benefits of humanity and the undead. They look much like normal kinds of their race, often becoming more attractive, though some have a hardened, feral look instead."
            }
          ]
        },
        {
          "name": "Vampire Traits",
          "body": [
            {
              "name": "Age",
              "body": "As undead, vampires are ageless, though some vampires are born and reach physical maturity at the same age as humans. Vampires who were turned later in life remain at the age they were turned until they are killed."
            },
            {
              "name": "Alignment",
              "body": "Contrary to popular myth, vampires come in all variations of alignment, though the spite tossed their way often influences many to the side of evil. Those who grew up in Sarille, however, where intelligent undead are widely accepted, often are raised to be blessings to their community."
            },
            {
              "name": "Size",
              "body": "Vampires are well-proportioned like their humanoid counterparts. Your size is Medium."
            },
            {
              "name": "Languages",
              "body": "You can speak, read, and write Common and one other language of your choice."
            },
            {
              "name": "The Walking Dead",
              "body": "Your creature type is Undead, rather than Humanoid. In addition, spells that have no effects on undead do not work on you, but healing potions and necrotic damage will heal you."
            },
            {
              "name": "Ability Score Increase",
              "body": "Increase either your Strength or Dexterity by 2, and increase your Constitution score by 1."
            },
            {
              "name": "The Eternal Hunger",
              "body": "Vampires need to drink at minimum 2 pints of blood per week, or else they gain 1 level of exhaustion that does not reduce until they consume their weekly intake of blood. The creature the blood originates from does not matter, only that they feast from a living creature. If they go multiple weeks without blood, the exhaustion levels increase for every week until death."
            },
            {
              "name": "Blood Bite",
              "body": "As an action, you may bite into a living creature's neck and take blood from them. The creature must be either willing or unable to resist, such as through the Stunned, Grabbed, or other conditions that prevent a creature from moving. Vampires only need drink two pints of blood per week, but may take more. In either case, the creature gains 1 level of exhaustion, and you regain 1d6 hitpoints. This healing increases to 2d6 at 5th level, 3d6 at 11th level, and 4d6 at 17th level."
            }
          ]
        },
        {
          "name": "Daywalker Vampire",
          "book": "Subrace",
          "body": [
            {
              "name": "Scorned of the Day",
              "body": "Manipulated flesh and negative energy has allowed special breeds of vampires to roam the worlds of Dekatreis. Daywalkers may march through the daylight, though they take 1d8 radiant damage that cannot be negated by any means each time they start their turn in unobstructed moonlight."
            },
            {
              "name": "Moroi Blood",
              "body": "Daywalker blood has been studied to be innately magical, allowing them to conjure minor magical effects. Choose one cantrip from the Cleric spell list. You can use that cantrip at will. In addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again."
            }
          ]
        },
        {
          "name": "Nightwalker Vampire",
          "book": "Subrace",
          "body": [
            {
              "name": "Children of the Night",
              "body": "Manipulated flesh and negative energy has allowed special breeds of vampires to roam the worlds of Dekatreis. Nightwalkers may march through the moonlight, though they take 1d8 radiant damage that cannot be negated by any means each time they start their turn in unobstructed sunlight."
            },
            {
              "name": "Darkvision",
              "body": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            }
          ]
        }
      ]
    }
  ]
}
